In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({
    "name": ["Alice", "Bob", "Charlie", "Diana", "Evan"],
    "age": [25, 30, None, 22, 40],
    "city": ["NY", "LA", "NY", "SF", "LA"],
    "height_m": [1.65, 1.80, 1.75, 1.60, 1.90],
    "weight_kg": [55, 82, 77, 60, 90],
    "salary": [72000, 85000, 56000, 63000, 120000]
})

In [3]:
print(df.head())
print(df.info())
print(df.describe())

      name   age city  height_m  weight_kg  salary
0    Alice  25.0   NY      1.65         55   72000
1      Bob  30.0   LA      1.80         82   85000
2  Charlie   NaN   NY      1.75         77   56000
3    Diana  22.0   SF      1.60         60   63000
4     Evan  40.0   LA      1.90         90  120000
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   name       5 non-null      object
 1   age        4 non-null      float64
 2   city       5 non-null      object
 3   height_m   5 non-null      float64
 4   weight_kg  5 non-null      int64
 5   salary     5 non-null      int64
dtypes: float64(2), int64(2), object(2)
memory usage: 372.0+ bytes
None
             age  height_m  weight_kg         salary
count   4.000000  5.000000   5.000000       5.000000
mean   29.250000  1.740000  72.800000   79200.000000
std     7.889867  0.119373  14.822281   25252.722625
min    22.000000  1.600000  55.000000   56000.000000
25%    24.250000  1.650000  60.000000   63000.000000
50%    27.500000  1.750000  77.000000   72000.000000
75%    32.500000  1.800000  82.000000   85000.000000
max    40.000000  1.900000  90.000000  120000.000000

In [4]:
df = df.drop_duplicates()
df["age"] = df["age"].fillna(df["age"].median())

In [5]:
df

      name   age city  height_m  weight_kg  salary
0    Alice  25.0   NY      1.65         55   72000
1      Bob  30.0   LA      1.80         82   85000
2  Charlie  27.5   NY      1.75         77   56000
3    Diana  22.0   SF      1.60         60   63000
4     Evan  40.0   LA      1.90         90  120000

In [6]:
df["bmi"] = df["weight_kg"] / df["height_m"]**2

In [7]:
adults = df[df["age"] >= 30]
subset = df[["name", "city", "salary"]]

In [8]:
avg_salary = df.groupby("city")["salary"].mean().reset_index()

In [9]:
top_salaries = df.sort_values("salary", ascending=False)

In [10]:
dept = pd.DataFrame({
    "name": ["Alice", "Bob", "Charlie", "Diana", "Evan"],
    "department": ["HR", "IT", "Finance", "Marketing", "IT"]
})